zephyrproject-rtos/zephyr/drivers/usb/device/usb_dc_stm32.c
/* Endpoint state */
struct usb_dc_stm32_ep_state {
	uint16_t ep_mps;		/** Endpoint max packet size */
	uint16_t ep_pma_buf_len;	/** Previously allocated buffer size */
	uint8_t ep_type;		/** Endpoint type (STM32 HAL enum) */
	uint8_t ep_stalled;	/** Endpoint stall flag */
	usb_dc_ep_callback cb;	/** Endpoint callback function */
	uint32_t read_count;	/** Number of bytes in read buffer  */
	uint32_t read_offset;	/** Current offset in read buffer */
	struct k_sem write_sem;	/** Write boolean semaphore */
};

/* ISR -> lower half message */
struct usb_dc_stm32_msg {
	union {
		enum usb_dc_status_code stack_cb_status;
		enum usb_dc_ep_cb_status_code ep_cb_status;
	};
	/* endpoint address or USB_MSG_TARGET_STACK */
	uint8_t target;
};

/* Driver state */
struct usb_dc_stm32_state {
	PCD_HandleTypeDef pcd;	/* Storage for the HAL_PCD api */
	usb_dc_status_callback status_cb; /* Status callback */
	struct usb_dc_stm32_ep_state out_ep_state[USB_NUM_BIDIR_ENDPOINTS];
	struct usb_dc_stm32_ep_state in_ep_state[USB_NUM_BIDIR_ENDPOINTS];
	struct k_thread isr_lower_half_thread;
	struct k_msgq isr_msgq;
	uint8_t ep_buf[USB_NUM_BIDIR_ENDPOINTS][EP_MPS];
	char msgq_buf[USB_ISR_MSGQ_SIZE * sizeof(struct usb_dc_stm32_msg)];

#if defined(USB) || defined(USB_DRD_FS)
	uint32_t pma_offset;
#endif /* USB */
};

K_THREAD_STACK_DEFINE(usb_dc_stm32_thr_stk, USB_ISR_LOWER_HALF_THREAD_STACK_SIZE);

static struct usb_dc_stm32_state usb_dc_stm32_state;

/* Internal functions */

/* these helpers are defined as macros such that LOG_ERR() call
 * is performed in caller's scope and has proper function name
 */
#define SEND_MSG_TO_LOWERHALF(_status_field, _status, _target)			\
	do {									\
		struct usb_dc_stm32_msg msg = {					\
			. _status_field = _status,				\
			.target = _target,					\
		};								\
										\
		int _errcode = k_msgq_put(					\
			&usb_dc_stm32_state.isr_msgq, &msg, K_NO_WAIT);		\
		if (_errcode != 0) {						\
			LOG_ERR("k_msgq_put() failed: %d", _errcode);		\
			__ASSERT_NO_MSG(0);					\
		}								\
	} while (0)

#define usb_dc_stm32_send_stack_msg(_status)				\
	SEND_MSG_TO_LOWERHALF(stack_cb_status, _status, USB_MSG_TARGET_STACK)

#define usb_dc_stm32_send_ep_msg(_ep, _status)				\
	SEND_MSG_TO_LOWERHALF(ep_cb_status, _status, _ep)

int usb_dc_ep_start_read(uint8_t ep, uint8_t *data, uint32_t max_data_len);

static void usb_dc_stm32_isr_lower_half(void *a1, void *a2, void *a3)
{
	ARG_UNUSED(a1);
	ARG_UNUSED(a2);
	ARG_UNUSED(a3);

	struct usb_dc_stm32_state *state = &usb_dc_stm32_state;
	struct usb_dc_stm32_msg msg;
	int res;

	while (true) {
		res = k_msgq_get(&state->isr_msgq, &msg, K_FOREVER);
		__ASSERT_NO_MSG(res == 0);

		if (msg.target == USB_MSG_TARGET_STACK) {
			if (state->status_cb != NULL) {
				state->status_cb(msg.stack_cb_status, NULL);
			}

			continue;
		}

		/* Endpoint target */
		struct usb_dc_stm32_ep_state *ep_state;
		const uint8_t ep_idx = USB_EP_GET_IDX(msg.target);

		if (USB_EP_DIR_IS_IN(msg.target)) {
			ep_state = &usb_dc_stm32_state.in_ep_state[ep_idx];
		} else { /* target is OUT ep */
			ep_state =  &usb_dc_stm32_state.out_ep_state[ep_idx];
		}

		if (ep_state->cb == NULL) {
			continue;
		}

		ep_state->cb(msg.target, msg.ep_cb_status);

		/* Special handling for SETUP event */
		if (msg.ep_cb_status == USB_DC_EP_SETUP) {
			struct usb_setup_packet *setup =
				(void *)usb_dc_stm32_state.pcd.Setup;

			if (!(setup->wLength == 0U) &&
				usb_reqtype_is_to_device(setup)) {
				usb_dc_ep_start_read(EP0_OUT,
						     usb_dc_stm32_state.ep_buf[EP0_IDX],
						     setup->wLength);
			}
		}
	}
}

static bool usb_dc_stm32_clock_enabled(void)
{
	const struct device *const clk = DEVICE_DT_GET(STM32_CLOCK_CONTROL_NODE);

	enum clock_control_status status = clock_control_get_status(
						clk, (clock_control_subsys_t)&pclken[0]);

	return status == CLOCK_CONTROL_STATUS_ON;
}

static struct usb_dc_stm32_ep_state *usb_dc_stm32_get_ep_state(uint8_t ep)
{
	struct usb_dc_stm32_ep_state *ep_state_base;

	if (USB_EP_GET_IDX(ep) >= USB_NUM_BIDIR_ENDPOINTS) {
		return NULL;
	}

	if (USB_EP_DIR_IS_OUT(ep)) {
		ep_state_base = usb_dc_stm32_state.out_ep_state;
	} else {
		ep_state_base = usb_dc_stm32_state.in_ep_state;
	}

	return ep_state_base + USB_EP_GET_IDX(ep);
}

static void usb_dc_stm32_isr(const void *arg)
{
	HAL_PCD_IRQHandler(&usb_dc_stm32_state.pcd);
}

#ifdef CONFIG_USB_DEVICE_SOF
void HAL_PCD_SOFCallback(PCD_HandleTypeDef *hpcd)
{
	usb_dc_stm32_send_stack_msg(USB_DC_SOF);
}
#endif

#if DT_HAS_COMPAT_STATUS_OKAY(st_stm32u5_otghs_phy)

static const struct stm32_pclken phy_pclken[] = STM32_DT_CLOCKS(DT_INST_PHANDLE(0, phys));

static int usb_dc_stm32u5_phy_clock_select(const struct device *const clk)
{
	static const struct {
		uint32_t freq;
		uint32_t ref_clk;
	} clk_select[] = {
		{ MHZ(16),    SYSCFG_OTG_HS_PHY_CLK_SELECT_1 },
		{ KHZ(19200), SYSCFG_OTG_HS_PHY_CLK_SELECT_2 },
		{ MHZ(20),    SYSCFG_OTG_HS_PHY_CLK_SELECT_3 },
		{ MHZ(24),    SYSCFG_OTG_HS_PHY_CLK_SELECT_4 },
		{ MHZ(26),    SYSCFG_OTG_HS_PHY_CLK_SELECT_5 },
		{ MHZ(32),    SYSCFG_OTG_HS_PHY_CLK_SELECT_6 },
	};
	uint32_t freq;

	if (clock_control_get_rate(clk,
				   (clock_control_subsys_t)&phy_pclken[1],
				   &freq) != 0) {
		LOG_ERR("Failed to get USB_PHY clock source rate");
		return -EIO;
	}

	for (size_t i = 0; ARRAY_SIZE(clk_select); i++) {
		if (clk_select[i].freq == freq) {
			HAL_SYSCFG_SetOTGPHYReferenceClockSelection(clk_select[i].ref_clk);
			return 0;
		}
	}

	LOG_ERR("Unsupported PHY clock source frequency (%"PRIu32")", freq);

	return -EINVAL;
}

static int usb_dc_stm32u5_phy_clock_enable(const struct device *const clk)
{
	int err;

	err = clock_control_configure(clk, (clock_control_subsys_t)&phy_pclken[1], NULL);
	if (err) {
		LOG_ERR("Could not select USB_PHY clock source");
		return -EIO;
	}

	err = clock_control_on(clk, (clock_control_subsys_t)&phy_pclken[0]);
	if (err) {
		LOG_ERR("Unable to enable USB_PHY clock");
		return -EIO;
	}

	return usb_dc_stm32u5_phy_clock_select(clk);
}

